{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_10",
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        100,
                        100,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_15_input"
                },
                "registered_name": null
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_15",
                    "trainable": true,
                    "dtype": "float32",
                    "batch_input_shape": [
                        null,
                        100,
                        100,
                        3
                    ],
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        100,
                        100,
                        3
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_11",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        98,
                        98,
                        32
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_16",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 74,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        49,
                        49,
                        32
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_12",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        47,
                        47,
                        74
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_15",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        23,
                        23,
                        74
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "SpecialActivation",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": {
                        "module": "builtins",
                        "class_name": "function",
                        "config": "custom_activation",
                        "registered_name": "function"
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        23,
                        23,
                        74
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_16",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        23,
                        23,
                        74
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_17",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 74,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "tanh",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        23,
                        23,
                        74
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_17",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        21,
                        21,
                        74
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_7",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        21,
                        21,
                        74
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_7",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 9,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32634
                    ]
                }
            }
        ]
    },
    "keras_version": "2.14.0",
    "backend": "tensorflow"
}